how-this-blog-works.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>LZ</title>
<meta name="generator" content="Org mode" />
<link rel="stylesheet" href="https://cdn.simplecss.org/simple.min.css" /><link rel="icon" href="data:image/svg+xml,<svg xmlns=%22http://www.w3.org/2000/svg%22 viewBox=%220 0 100 100%22><text y=%22.9em%22 font-size=%2290%22>👻</text></svg>">
</head>
<body>
<div id="content">
<h1 class="title">LZ</h1>
<p>
<a href="./index.html">home</a>
</p>

<div id="outline-container-org0600b9c" class="outline-2">
<h2 id="org0600b9c">How this blog works</h2>
<div class="outline-text-2" id="text-org0600b9c">
<p>
Thought I'd share a few details about it because I've been looking for the right 
blogging method for me, and finally I've fallen on something that I think will work 
nicely.
</p>
</div>

<div id="outline-container-org9361d9b" class="outline-3">
<h3 id="org9361d9b">Org mode</h3>
<div class="outline-text-3" id="text-org9361d9b">
<p>
Org mode is a markup format that comes from the Emacs world (although it is used outside
Emacs as well). It's nice to write in because the marked-up text is still very clean 
and readable.
</p>

<p>
Org mode has some build-in "publishing" capability. It is able to export to HTML. I
use a short emacs-lisp script to achive this. It simply sets a few config vars and
calls the <code>org-publish-project-alist</code> function to walk the content directory and 
convert my blog posts to html.
</p>


<div class="org-src-container">
<pre class="src src-elisp">(<span class="org-keyword">require</span> '<span class="org-constant">ox-publish</span>)

(<span class="org-keyword">setq</span> org-html-validation-link nil
      org-html-head-include-scripts nil
      org-html-head-include-default-style nil
      org-html-head <span class="org-string">"&lt;link rel=\"stylesheet\" href=\"https://cdn.simplecss.org/simple.min.css\" /&gt;"</span>)


<span class="org-comment-delimiter">;; </span><span class="org-comment">Define the publishing project</span>
(<span class="org-keyword">setq</span> org-publish-project-alist
      (list
       (list
        <span class="org-string">"orgfiles"</span>
        <span class="org-builtin">:recursive</span> t
        <span class="org-builtin">:base-directory</span> <span class="org-string">"./content"</span>
        <span class="org-builtin">:publishing-directory</span> <span class="org-string">"./"</span>
        <span class="org-builtin">:publishing-function</span> 'org-html-publish-to-html
        <span class="org-builtin">:with-author</span> nil
        <span class="org-builtin">:include-toc</span> nil
        <span class="org-builtin">:section-numbers</span> nil
        <span class="org-builtin">:time-stamp-file</span> nil)))

<span class="org-comment-delimiter">;; </span><span class="org-comment">Generate the site output</span>
(org-publish-all t)

(message <span class="org-string">"Build complete!"</span>)
</pre>
</div>
</div>
</div>


<div id="outline-container-orgd117d5d" class="outline-3">
<h3 id="orgd117d5d">Github pages</h3>
<div class="outline-text-3" id="text-orgd117d5d">
<p>
You can <a href="https://github.com/larzeitlin/blog">see the repo here</a>. Github pages detects the <code>index.html</code>, which then links to the 
other files.
</p>
</div>
</div>

<div id="outline-container-orgc1611c1" class="outline-3">
<h3 id="orgc1611c1">Thanks</h3>
<div class="outline-text-3" id="text-orgc1611c1">
<p>
This was inspired by <a href="https://systemcrafters.net/publishing-websites-with-org-mode/building-the-site/">System Crafters</a>. So thanks to David for that and all his great content.
</p>
</div>
</div>
</div>
</div>
</body>
</html>
